app/controllers/calculates_controller.rb

SELECT "calculates".* FROM "calculates"
---
  def new
    @calculates = Calculate.all

INSERT INTO "calculates" ("first", "second", "operator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first", 1], ["second", 2], ["operator", "+"], ["created_at", 2017-04-02 20:54:55 UTC], ["updated_at", 2017-04-02 20:54:55 UTC]]
---
  def create
    calculate = Calculate.new(post_params)
    calculate.save